package ru.teachmeskills.homework3;

public class Exercise11 {
    // Составьте программу, выводящую на экран квадраты чисел от 10 до 20
    //включительно.
    public static void main(String[] args) {
        for (int i = 10; i<=20; i++) {
            System.out.println("Квадрат числа " + i+ " = " + i * i);
        }
    }
}
